app/Helpers/CIFunctions_helper.php

SELECT *
FROM `user`
WHERE `id_user` = '2'
 LIMIT 1
---
    function get_user()
    {
        if (CIAuth::check()) {
            $user = new User();
            return $user->asObject()->where('id_user', CIAuth::id())->first();